# Да се създаде функция, която с помощта на while цикъл извежда всички положителни цели числа по-малки от 5 със зададена начална стойност 1.
# След приключване на цикъла да се изведе съобщение: "Програмата е прекратена".
# Да се добави изключение, при което се извежда съобщение: "Цикълът приключи".
def task1(i):
    try:
        while i < 5:
            print(i)
            i += 1
    except Exception:
        print("Цикълът приключи")
    else:
        print("Програмата е прекратена")

task1(1)