%AFH e програма за симулиране на честотни характеристики.
%За да бъде изпълнена програмата е необходимода предварително в работното пространство
%на Matlab да бъдат въведени :
%   st= - стъпка на изменение на честотата
%   br= - брой точки в коити ще се проведе симулирането
%   А=[  ] - коефициентите на полинома в знаменател.
%   Въвеждането се извършва в низходящ ред по степените на "р"
%   B=[  ] - коефициентите на полинома в числител.
%   Въвеждането се извършва в низходящ ред по степените на "р"
%Програмата позволява симулираните АФХ да бъдат зашумени. 
W=(0:st:((br-1)*st));
[U,V,W]=NYQUIST(B,A,W);
plot(U,V)

